NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFM32PG23/EFM32PG23B310F256IM48.svd
        <register>
          <name>IF</name>
          <description>No Description</description>
          <addressOffset>0x02C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>FC</name>
              <description>Frame Counter </description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISPLAY</name>
              <description>Display Update Event</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNCBUSYDONE</name>
              <description>Synchronization is Done</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IEN</name>
          <description>No Description</description>
          <addressOffset>0x030</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>FC</name>
              <description>Frame Counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISPLAY</name>
              <description>Display Update Event</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNCBUSYDONE</name>
              <description>Sync Busy Done</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BIASCTRL</name>
          <description>No Description</description>
          <addressOffset>0x034</addressOffset>
          <access>read-write</access>
          <resetValue>0x001F0000</resetValue>
          <resetMask>0xC45F137F</resetMask>
          <fields>
            <field>
              <name>RESISTOR</name>
              <description>Resistor strength</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUFDRV</name>
              <description>Buffer Drive Strength</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUFBIAS</name>
              <description>Buffer Bias Setting</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE</name>
              <description>Mode Setting</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STEPDOWN</name>
                  <description>Use step down control with VLCD less than VDDX. Use VLCD[4:0] to control VLCD level, and use SPEED to adjust VLCD drive strength.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHARGEPUMP</name>
                  <description>Use the charge pump to pump VLCD above VDDX.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VLCD</name>
              <description>VLCD voltage level</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VDDXSEL</name>
              <description>VDDX select</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DVDD</name>
                  <description>Connect charge pump to digital DVDD supply</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVDD</name>
                  <description>Connect charge pump to analog AVDD supply</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LCDGATE</name>
              <description>LCD Gate</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNGATE</name>
                  <description>LCD BIAS voltages driven onto pins.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GATE</name>
                  <description>LCD BIAS MUX tristated at the pins.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMAMODE</name>
              <description>DMA Mode</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMADISABLE</name>
                  <description>No DMA requests are generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAFC</name>
                  <description>DMA request on frame counter event. This will also start a DMA transfer during EM23. </description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADISPLAY</name>
                  <description>DMA request on display counter event. This will also start a DMA transfer during EM23. </description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DISPCTRLX</name>
          <description>No Description</description>
          <addressOffset>0x038</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000003FF</resetMask>
          <fields>
            <field>
              <name>DISPLAYDIV</name>
              <description>Display Divider</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEGD0</name>
          <description>No Description</description>
          <addressOffset>0x040</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000FFFFF</resetMask>
          <fields>
            <field>
              <name>SEGD0</name>
              <description>COM0 Segment Data Low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEGD1</name>
          <description>No Description</description>
          <addressOffset>0x048</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000FFFFF</resetMask>
          <fields>
            <field>
              <name>SEGD1</name>
              <description>COM1 Segment Data Low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEGD2</name>
          <description>No Description</description>
          <addressOffset>0x050</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000FFFFF</resetMask>
          <fields>
            <field>
              <name>SEGD2</name>
              <description>COM2 Segment Data Low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEGD3</name>
          <description>No Description</description>
          <addressOffset>0x058</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000FFFFF</resetMask>
          <fields>
            <field>
              <name>SEGD3</name>
              <description>COM3 Segment Data Low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UPDATECTRL</name>
          <description>No Description</description>
          <addressOffset>0x0C0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0001E100</resetMask>
          <fields>
            <field>
              <name>AUTOLOAD</name>
              <description>Auto Load</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MANUAL</name>
                  <description>CLK_BUS register to CLK_PER register loads must be done manually with a write to CMD.LOAD. </description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUTO</name>
                  <description>CLK_BUS register to CLK_PER register loads will be started automatically after a write to the register in UPDATECTRL.LOADADDR is detected.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOADADDR</name>
              <description>Load Address</description>
              <bitOffset>13</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BACTRLWR</name>
                  <description>Starts synchronizing registers from CLK_BUS to CLK_PER after a write to BACTRL.  Use with UPDATECTRL.AUTOLOAD</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AREGAWR</name>
                  <description>Starts synchronizing registers from CLK_BUS to CLK_PER after a write to AREGA.  Use with UPDATECTRL.AUTOLOAD</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AREGBWR</name>
                  <description>Starts synchronizing registers from CLK_BUS to CLK_PER after a write to AREGB.  Use with UPDATECTRL.AUTOLOAD</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEGD0WR</name>
                  <description>Starts synchronizing registers from CLK_BUS to CLK_PER after a write to SEGD0.  Use with UPDATECTRL.AUTOLOAD</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEGD1WR</name>
                  <description>Starts synchronizing registers from CLK_BUS to CLK_PER after a write to SEGD1.  Use with UPDATECTRL.AUTOLOAD</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEGD2WR</name>
                  <description>Starts synchronizing registers from CLK_BUS to CLK_PER after a write to SEGD2.  Use with UPDATECTRL.AUTOLOAD</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEGD3WR</name>
                  <description>Starts synchronizing registers from CLK_BUS to CLK_PER after a write to SEGD3.  Use with UPDATECTRL.AUTOLOAD</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FRAMERATE</name>
          <description>No Description</description>
          <addressOffset>0x0F0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000001FF</resetMask>
          <fields>
            <field>
              <name>FRDIV</name>
              <description>Frame Rate Divider</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
